<!-- azurenoops/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"9463a6940af65ef5e19c9d7321f0b729b1a7799c6a88cdcd488c5221fb9fadce","plan_job_ref":"Job Create MPE Management terraform plan #29 at https://github.com/AFMPE/mpe_management/actions/runs/7616056036","plan_hash":"89c0bc2274c871f5890e56fd4f53bc53f2ceb72a2d5a82ae0c6d2305ff5d1fbb","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __infrastructure/terraform__
With backend config: `storage_account_name=afmpetfmgtprodh8dc4qua
container_name=ampev2            
resource_group_name=afmpe-network-artifacts-rg
`
With var files: `infrastructure/terraform/tfvars/parameters.tfvars
`<details open><summary>With variables</summary>

```hcl
subscription_id_codex    = (sensitive value)
subscription_id_dev      = (sensitive value)
subscription_id_devlab   = (sensitive value)
subscription_id_forensic = (sensitive value)
subscription_id_hub      = (sensitive value)
subscription_id_identity = (sensitive value)
subscription_id_sandbox  = (sensitive value)
subscription_id_security = (sensitive value)
vm_admin_password        = (sensitive value)
```
</details>
<details>
<summary>Plan: 5 to add, 4 to change, 0 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.mod_bastion_jmp_virtual_machine[0].azurerm_network_interface.nic[0] will be updated in-place
  ~ resource "azurerm_network_interface" "nic" {
        id                            = "/subscriptions/7eb60145-02f2-4fc1-80d2-e25d2ce9e45d/resourceGroups/ampe-eus-devsecops-prod-rg/providers/Microsoft.Network/networkInterfaces/ampe-eus-jmp-prod-nic"
        name                          = "ampe-eus-jmp-prod-nic"
        tags                          = {
            "ResourceName" = "ampe-eus-jmp-prod-nic"
            "deployedBy"   = "AzureNoOpsTF"
        }
        # (11 unchanged attributes hidden)

      ~ ip_configuration {
          ~ name                          = "ipconig-vmnicipconfig1" -> "ipconfig-vmnicipconfig1"
            # (5 unchanged attributes hidden)
        }
    }

  # module.mod_id_network.data.azurerm_network_watcher.nwatcher will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_network_watcher" "nwatcher" {
      + id                  = (known after apply)
      + location            = (known after apply)
      + name                = "NetworkWatcher_eastus"
      + resource_group_name = "NetworkWatcherRG"
      + tags                = (known after apply)
    }

  # module.mod_id_network.data.azurerm_resource_group.netwatch will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_resource_group" "netwatch" {
      + id         = (known after apply)
      + location   = (known after apply)
      + managed_by = (known after apply)
      + name       = "NetworkWatcherRG"
      + tags       = (known after apply)
    }

  # module.mod_id_network.azurerm_network_security_group.nsg["jumpbox"] will be created
  + resource "azurerm_network_security_group" "nsg" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "ampe-eus-id-prod-jumpbox-nsg"
      + resource_group_name = "ampe-eus-id-prod-rg"
      + security_rule       = (known after apply)
      + tags                = {
          + "ResourceName" = "nsg_jumpbox"
          + "deployedBy"   = "AzureNoOpsTF"
          + "env"          = "prod"
          + "workload"     = "id"
        }
    }

  # module.mod_id_network.azurerm_network_watcher_flow_log.nwflog["jumpbox"] will be created
  + resource "azurerm_network_watcher_flow_log" "nwflog" {
      + enabled                   = true
      + id                        = (known after apply)
      + location                  = (known after apply)
      + name                      = "network-watcher-flog-log-jumpbox"
      + network_security_group_id = (known after apply)
      + network_watcher_name      = "NetworkWatcher_eastus"
      + resource_group_name       = "NetworkWatcherRG"
      + storage_account_id        = "**********************************************************************************************************************************************************"
      + version                   = 2

      + retention_policy {
          + days    = 0
          + enabled = true
        }

      + traffic_analytics {
          + enabled               = true
          + interval_in_minutes   = 10
          + workspace_id          = "************************************"
          + workspace_region      = "eastus"
          + workspace_resource_id = "****************************************************************************************************************************************************************************************"
        }
    }

  # module.mod_id_network.azurerm_subnet.default_snet["jumpbox"] will be created
  + resource "azurerm_subnet" "default_snet" {
      + address_prefixes                               = [
          + "192.168.1.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "ampe-eus-id-prod-jumpbox-snet"
      + private_endpoint_network_policies_enabled      = false
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "ampe-eus-id-prod-rg"
      + service_endpoints                              = [
          + "Microsoft.Storage",
        ]
      + virtual_network_name                           = "ampe-eus-id-prod-vnet"
    }

  # module.mod_id_network.azurerm_subnet_network_security_group_association.nsgassoc["jumpbox"] will be created
  + resource "azurerm_subnet_network_security_group_association" "nsgassoc" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.mod_id_network.azurerm_subnet_route_table_association.rtassoc["jumpbox"] will be created
  + resource "azurerm_subnet_route_table_association" "rtassoc" {
      + id             = (known after apply)
      + route_table_id = "*****************************************************************************************************************************************************"
      + subnet_id      = (known after apply)
    }

  # module.mod_id_network.azurerm_virtual_network.spoke_vnet will be updated in-place
  ~ resource "azurerm_virtual_network" "spoke_vnet" {
      ~ address_space           = [
            "10.8.9.0/24",
          + "192.168.1.0/24",
        ]
        id                      = "/subscriptions/6de24b6c-e2f1-4cad-a222-3512b49eeb49/resourceGroups/ampe-eus-id-prod-rg/providers/Microsoft.Network/virtualNetworks/ampe-eus-id-prod-vnet"
        name                    = "ampe-eus-id-prod-vnet"
        tags                    = {
            "ResourceName" = "ampe-eus-id-prod-vnet"
            "deployedBy"   = "AzureNoOpsTF"
            "env"          = "prod"
            "workload"     = "id"
        }
        # (6 unchanged attributes hidden)
    }

  # module.mod_shared_keyvault[0].data.azurerm_private_endpoint_connection.pip[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_private_endpoint_connection" "pip" {
      + id                         = (known after apply)
      + location                   = (known after apply)
      + name                       = "ampe-eus-shared-keys-kv-private-endpoint"
      + network_interface          = (known after apply)
      + private_service_connection = (known after apply)
      + resource_group_name        = "ampe-eus-devsecops-prod-rg"
    }

  # module.mod_shared_keyvault[0].azurerm_key_vault.keyvault[0] will be updated in-place
  ~ resource "azurerm_key_vault" "keyvault" {
        id                              = "/subscriptions/7eb60145-02f2-4fc1-80d2-e25d2ce9e45d/resourceGroups/ampe-eus-devsecops-prod-rg/providers/Microsoft.KeyVault/vaults/ampe-eus-shared-keys-kv"
        name                            = "ampe-eus-shared-keys-kv"
        tags                            = {
            "deployedBy"  = "AzureNoOpsTF"
            "environment" = "public"
            "workload"    = "shared-keys"
        }
        # (13 unchanged attributes hidden)

      ~ network_acls {
          ~ ip_rules                   = [
              - "67.77.83.175/32",
            ]
            # (3 unchanged attributes hidden)
        }
    }

  # module.mod_shared_keyvault[0].azurerm_private_dns_a_record.a_rec[0] will be updated in-place
  ~ resource "azurerm_private_dns_a_record" "a_rec" {
        id                  = "/subscriptions/7eb60145-02f2-4fc1-80d2-e25d2ce9e45d/resourceGroups/ampe-eus-devsecops-prod-rg/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net/A/ampe-eus-shared-keys-kv"
        name                = "ampe-eus-shared-keys-kv"
      ~ records             = [
          - "10.8.7.100",
        ] -> (known after apply)
        tags                = {}
        # (4 unchanged attributes hidden)
    }

Plan: 5 to add, 4 to change, 0 to destroy.

Changes to Outputs:
  ~ identity_default_nsg_names                   = {
      + jumpbox = {
          + key  = "jumpbox"
          + name = "ampe-eus-id-prod-jumpbox-nsg"
        }
        # (2 unchanged attributes hidden)
    }
  ~ identity_default_subnet_ids                  = {
      ~ default = {
          ~ name = "/subscriptions/6de24b6c-e2f1-4cad-a222-3512b49eeb49/resourceGroups/ampe-eus-id-prod-rg/providers/Microsoft.Network/virtualNetworks/ampe-eus-id-prod-vnet/subnets/ampe-eus-id-prod-default-snet" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
      + jumpbox = {
          + key  = "jumpbox"
          + name = (known after apply)
        }
      ~ vm      = {
          ~ name = "/subscriptions/6de24b6c-e2f1-4cad-a222-3512b49eeb49/resourceGroups/ampe-eus-id-prod-rg/providers/Microsoft.Network/virtualNetworks/ampe-eus-id-prod-vnet/subnets/ampe-eus-id-prod-vm-snet" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }
  ~ identity_default_subnet_names                = {
      + jumpbox = {
          + key  = "jumpbox"
          + name = "ampe-eus-id-prod-jumpbox-snet"
        }
        # (2 unchanged attributes hidden)
    }
```
</details>

:memo: Plan generated in [Create MPE Management terraform plan #29](https://github.com/AFMPE/mpe_management/actions/runs/7616056036)